Repository: u2yasan/quick_learning_symbol_php_drupal
Catalog: modules/qls_ch3/translations/*.po
Languages: it, ja

source: An account is a data deposit structure in which information and assets associated with a private key is recorded. Only by signing with the private key associated with the account is the data updated on the blockchain.
it: Un indirizzo è una struttura dati di memorizzazione delle informazioni, divenute beni di proprietà perchè associati ad una chiave privata. Condizione necessaria e sufficiente per la loro registrazione e aggiornamento nella blockchain è applicarvi l’operazione di firma con la chiave privata dell’Indirizzo.
ja: アカウントは秘密鍵に紐づく情報が記録されたデータ構造体です。アカウントと関連づいた秘密鍵を使って署名することでのみブロックチェーンのデータを更新することができます。

source: The account contains a key pair, which is a set of private and public keys, an address and other information. First of all, try creating an account randomly and check the information that is contained.
it: L’Indirizzo contiene una coppia di chiavi, ovvero un insieme di chiavi pubbliche e chiavi private, il nome dell’Indirizzo stesso e altre informazioni. Per prima cosa, creeremo un Indirizzo casuale e controlleremo le informazioni ivi contenute.
ja: アカウントには秘密鍵と公開鍵をセットにしたキーペア、アドレスなどの情報が含まれています。まずはランダムにアカウントを作成して、それらの情報を確認してみましょう。

source: If the private key is lost, the data associated with that account can never be changed and any funds will be lost. In addition, the private key must not be shared with others since knowledge of the private key will give full access to the account. In general web services, passwords are allocated to an "account ID", so passwords can be changed from the account, but in blockchain, a unique ID (address) is allocated to the private key that is the password, thus it is not possible to change or re-generate the private key associated with an account from the account.
it: La perdita della chiave privata implica la perdita irrevocabile di ogni dato interno all’Indirizzo, tutte le quantità finanziarie andranno perse. Inoltre la chiave privata non deve essere condivisa con terze parti eccezzion fatta per i casi in cui sia necessario fornire il controllo completo dell’Indirizzo. Nello sviluppo di web services generici, le password vengono memorizzate in un “account ID”, in modo da poter cambiare le password partendo dall’Indirizzo. Diversamente nella blockchain, l’ID (Indirizzo) è univocamente legato alla chiave privata che svolge la funzione di password, quindi non è possibile cambiare o rigenerare la chiave privata associata ad un Indirizzo partendo dal nome.
ja: 秘密鍵を紛失するとそのアカウントに紐づけられたデータを操作することが出来なくなります。また、他人は知らないという秘密鍵の性質を利用してデータ操作の署名を行うので、秘密鍵を他人に教えてはいけません。組織のなかで秘密鍵を譲り受けて運用を続けるといった行為も控えましょう。一般的な Web サービスでは「アカウント ID」に対してパスワードが割り振られるため、パスワードの変更が可能ですが、ブロックチェーンではパスワードにあたる秘密鍵に対して一意に決まる ID(アドレス)が割り振られるため、アカウントに紐づく秘密鍵を変更するということはできません。

source: These things above are the most basic information for operating the blockchain. It is also better to check how to generate accounts from a private key and how to generate classes that only deal with publickey and addresses.
it: Quanto esposto prima costituisce le informazioni di base per operare con la blockchain. E’ utile provare a creare Indirizzi dalla chiave privata ma anche creare classi che si istanziano dalla chiave pubblica o dal nome dell’Indirizzo.
ja: これらがブロックチェーンを操作するための最も基本的な情報となります。また、秘密鍵からアカウントを生成したり、公開鍵やアドレスのみを扱うクラスの生成方法も確認しておきましょう。

source: Creating an account does not simply mean that data can be transferred on the blockchain. Public blockchains require fees for data transfer in order to utilise resources effectively. On the Symbol blockchain, fees are paid with a native token which is called XYM. Once you have generated an account, send XYM to the account to cover transaction fees (described in later chapters).
it: Creare un Indirizzo non è sufficiente a trasferire informazioni nella blockchain. Le blockchain pubbliche obbligano a versare delle commissioni di trasferimento dati quando si consumano risorse. Nella blockchain Symbol, le commissioni si pagano con il token nativo chiamato XYM. Una quantità di XYM sarà trasferita all’Indirizzo dopo averlo creato, a copertura delle commissioni della transazione (come vedremo in seguito).
ja: アカウントを作成しただけでは、ブロックチェーンにデータを送信することはできません。パブリックブロックチェーンはリソースを有効活用するためにデータ送信時に手数料を要求します。Symbolブロックチェーンでは、この手数料をXYMという共通トークンで支払うことになります。アカウントを生成したら、この後の章から説明するトランザクションを実行するために必要な手数料を送信しておきます。

source: Testnet XYM can be obtained for free using the faucet. For Mainnet transactions, you can buy XYM on exchanges, or use tipping services such QUEST to have obtain donations.
it: Monete XYM della rete di test (testnet) si possono ricevere senza costi dal rubinetto ‘faucet’. Per eseguire transazioni sulla rete di produzione (mainnet), gli XYM possono essere acquistati nei siti di cambiovaluta (exchange), o dai servizi di donazioni per prestazioni occasionali, quali QUEST.
ja: テストネットではフォーセット（蛇口）サービスから検証用の XYM を入手することができます。メインネットの場合は取引所などでXYMを購入するか、投げ銭サービス(QUEST)などを利用して寄付を募りましょう。

source: Transactions can be viewed in the explorer after transferring from the faucet to the account you have created.
it: L’applicazione web ‘explorer’ ritorna l’elenco delle transazioni, compresa quella dal faucet al nostro Indirizzo appena creato.
ja: フォーセットから作成したアカウントへ送信が成功したらエクスプローラーで確認してみましょう。

source: Retrieve the account information stored by the node.
it: Per la verifica è necessario recuperare le informazioni dell’Indirizzo memorizzate in un nodo della rete.
ja: ノードに保存されているアカウント情報を取得します。

source: Account information which has just been created on the client side and has not yet been involved in a transaction on the blockchain is not recorded. Account information will be stored on the blockchain when when the address first appears in a transaction. Therefore, the publicKey is noted as `00000...` at this moment.
it: Tutte le informazioni di un Indirizzo appena creato dal client non verranno memorizzate nella blockchain se l’Indirizzo non sarà oggetto di una transazione. Ciò spiega il valore `00000…` ritornato per la chiave pubblica.
ja: クライアント側で作成しただけで、ブロックチェーンでまだ利用されていないアカウント情報は記録されていません。宛先として指定されて受信することで初めてアカウント情報が記録され、署名したトランザクションを送信することで公開鍵の情報が記録されます。そのため、publicKeyは現在`00000…`表記となっています。

source: Both private and public keys generated for an account can be used for conventional encryption and digital signatures. Data confidentiality and legitimacy can be verified on a p2p (end-to-end) basis, even if applications have reliability issues.
it: La chiave privata, ma anche la pubblica di un Indirizzo, possono essere usate per operazioni di cifratura e firma digitale. Si possono verificare la segretezza e la paternità ai due estremi di una comunicazione, persino in condizioni di applicazioni inaffidabili.
ja: アカウントとして生成した秘密鍵や公開鍵は、そのまま従来の暗号化や電子署名として活用することができます。信頼性に問題点があるアプリケーションを使用する必要がある場合も、個人間（エンドツーエンド）でデータの秘匿性・正当性を検証することができます。

source: Advance preparation: generating Bob account for connectivity test
it: Prova avanzata: creare l’Indirizzo di Bob per un test di trasmissione
ja: 事前準備：対話のためのBobアカウントを生成

source: Encrypt with Alice's private key and Bob's public key and decrypt with Alice's public key and Bob's private key (AES-GCM format).
it: Cifrare un messaggio con la chiave privata di Alice, poi cifrarlo con la chiave pubblica di Bob, il risultato ottenuto decifrarlo con la chiave privata di Bob, poi con la chiave pubblica di Alice (formato AES-GCM).
ja: Aliceの秘密鍵・Bobの公開鍵で暗号化し、Aliceの公開鍵・Bobの秘密鍵で復号します（AES-GCM 形式）。

source: Sign the message with Alice's private key and verify the message with Alice's public key and signature.
it: Firma del messaggio con la chiave privata di Alice e verifica della firma con la chiave pubblica di Alice.
ja: Aliceの秘密鍵でメッセージを署名し、Aliceの公開鍵と署名でメッセージを検証します。

source: Note that signatures that do not use the blockchain may be re-used many times.
it: Notare che se le firme non usano la blockchain possono essere riutilizzate più volte.
ja: ブロックチェーンを使用しない署名は何度も再利用される可能性があることにご注意ください。

source: Account
it: Indirizzo sulla catena di blocchi
ja: アカウント

source: Creating an account
it: Creazione di un indirizzo
ja: アカウント生成

source: Create a new account
it: Creazione di un nuovo Indirizzo
ja: 新規生成

source: Sample output
it: Output esemplificativo
ja: 出力例

source: Address class generation
it: Istanziare la classe Indirizzo
ja: アドレスクラスの生成

source: Notes
it: Note
ja: 注意事項

source: Deriving of address
it: Calcolo del nome dell’Indirizzo
ja: アドレスの導出

source: Account generation from private key
it: Creazione di un Indirizzo a partire dalla chiave privata
ja: 秘密鍵からアカウント生成

source: Public key class generation
it: Istanziare la classe Indirizzo pubblico partendo dalla chiave pubblica
ja: 公開鍵クラスの生成

source: TransferTransaction to another account
it: Trasferimento verso un Indirizzo
ja: アカウントへの送信

source: Receive XYM from the faucet
it: Ricezione di XYM dal faucet
ja: フォーセットから送信

source: Testnet
ja: テストネット

source: FAUCET
ja: 蛇口

source: Mainnet
ja: メインネット

source: Using the explorer
it: Ispezionare la blockchain con l’explorer
ja: エクスプローラーで確認

source: Check account information
it: Verifica dei dati di un indirizzo
ja: アカウント情報の確認

source: Retrieve a list of owned mosaics
it: Recuperare la lista dei Mosaic associati all’Indirizzo
ja: 所有モザイク一覧の取得

source: Tips for use
it: Consigli pratici
ja: 現場で使えるヒント

source: Encryption and signatures
it: Cifratura e firma
ja: 暗号化と署名

source: Encryption
it: Cifratura
ja: 暗号化

source: Decrypt
ja: 復号化

source: Signature
it: Firma
ja: 署名

source: Verification
ja: 検証
